Repository: eddyem/mytakepic
Catalog: fli_control/locale/*/*.po
Languages: ru

source: %.3f seconds till exposition ends
ru: %.3f секунд до окончания экспозиции

source: %d seconds till pause ends
ru: %d секунд до окончания паузы

source: %s CCD shutter
ru: %s затвор ПЗС

source: %s: argument needed!
ru: %s: необходим аргумент!

source: Already at position
ru: Уже на позиции

source: Array field: (%ld, %ld)(%ld, %ld)
ru: Поле изображения: (%ld, %ld)(%ld, %ld)

source: Arrive to position
ru: Прибыл на позицию

source: Camera '%s', domain %s
ru: Камера '%s' из домена %s

source: Can't close mmap'ed file
ru: Не могу закрыть mmap'нутый файл

source: Can't get settings
ru: Не могу получить настройки

source: Can't munmap
ru: Не могу munmap

source: Can't open %s for reading
ru: Не могу открыть %s для чтения

source: Can't save file
ru: Не могу сохранить файл

source: Can't set settings
ru: Не могу установить настройки

source: Can't setup console
ru: Не могу настроить консоль

source: Can't stat %s
ru: Не могу выполнить stat %s

source: Capture frame %d
ru: Захват кадра %d

source: Error in position detection
ru: Ошибка определения позиции

source: Field of view: %s
ru: Видимое поле: %s

source: File saved as '%s'
ru: Файл записан в '%s'

source: Focuser '%s', domain %s
ru: Фокусер '%s', домен %s

source: HW revision: %ld
ru: Апп. версия: %ld

source: Image stat:
ru: Статистика по изображению:

source: Integer out of range
ru: Целое вне допустимого диапазона

source: Library version '%s'
ru: Версия библиотеки '%s'

source: Mmap error for input
ru: Ошибка mmap

source: Model: %s
ru: Модель: %s

source: Moving for %ld steps
ru: Перемещение на %ld шагов

source: Moving to home position
ru: Перемещение в нулевую позицию

source: N flushes before exposing
ru: N сбросов до экспозиции

source: No CCD found
ru: ПЗС не обнаружено

source: No filename given!
ru: Не задано имя файла!

source: No focusers found
ru: Не найден фокусер

source: No wheels found
ru: Не найдены турели

source: Pixel size: %g x %g
ru: Размер пикселя: %g x %g

source: Position should be in 0...%ld
ru: Позиция не должна выходить за пределы 0...%ld

source: Read image:
ru: Считывание изображения:

source: SW revision: %ld
ru: Прогр. версия: %ld

source: Set CCD temperature to %g degr.C
ru: Установка температуры ПЗС: %g градусов Цельсия

source: Try to convfigure I/O port as %d
ru: Попытка сконфигурировать порт I/O как %d

source: Try to write %d to I/O port
ru: Попытка записи %d в порт I/O

source: Wheel '%s', domain %s
ru: Колесо '%s', домен %s

source: Wheel position should be from 0 to %ld
ru: Номер позиции колеса: от 0 до %ld

source: Wrong argument "%s" of parameter "%s"
ru: Неправильный аргумент "%s" параметра "%s"

source: Wrong helpstring!
ru: Неправильный формат строки помощи!

source: Wrong parameter: %s
ru: Неправильный параметр: %s

source: You can't use both relative and absolute position
ru: Нельзя одновременно указывать относительную и абсолютную позицию

source: close shutter
ru: закрыть затвор

source: configure I/O port pins to given value (decimal number, pin1 is LSB, 1 == output, 0 == input)
ru: настроить пины порта I/O (десятичное значение, пин 1 - младший, 1 == выход, 0 == вход)

source: date/time
ru: дата/время

source: frame X0 coordinate (-1 - all with overscan)
ru: X0 координата фрейма (-1 - вместе с оверсканом)

source: frame X1 coordinate (-1 - all with overscan)
ru: X1 координата фрейма (-1 - вместе с оверсканом)

source: frame Y0 coordinate (-1 - all with overscan)
ru: Y0 координата фрейма (-1 - вместе с оверсканом)

source: frame Y1 coordinate (-1 - all with overscan)
ru: Y1 координата фрейма (-1 - вместе с оверсканом)

source: get value of I/O port pins
ru: получить значение пинов порта I/O

source: horizontal binning to N pixels
ru: горизонтальный биннинг на N пикселей

source: instrument name
ru: название инструмента

source: make pause for N seconds between expositions
ru: пауза на N секунд между экспозициями

source: make series of N frames
ru: последовательность N кадров

source: move focuser to absolute position
ru: переместить фокусер в абсолютную позицию

source: move focuser to relative position
ru: переместить фокусер в абсолютную позицию

source: move stepper motor asynchronous
ru: двигать шаговый асинхронно

source: not open shutter, when exposing ("dark frames")
ru: съемка темновых

source: object name
ru: название объекта

source: object type (neon, object, flat etc)
ru: тип объекта (neon, object, flat и т.п.)

source: observers' names
ru: имена наблюдателей

source: observing program name
ru: название программы

source: open shutter
ru: открыть затвор

source: program author
ru: автор программы

source: rewrite output file if exists
ru: перезаписать выходной файл

source: run exposition on HIGH @ pin5 I/O port
ru: запуск экспозиции при высоком сигнале на пине5 порта I/O

source: run exposition on LOW @ pin5 I/O port
ru: запуск экспозиции при низком сигнале на пине5 порта I/O

source: set CCD temperature to given value (degr C)
ru: установить температуру ПЗС (градусы Ц)

source: set I/O port pins to given value (decimal number, pin1 is LSB)
ru: установить порт I/O в заданное значение (десятичное число, пин1 - младший)

source: set exposure time to given value (ms)
ru: установить время экспозиции (мс)

source: set wheel position
ru: установить положение колеса

source: show this help
ru: отобразить эту справку

source: verbose level (each -v increase it)
ru: уровень сообщений (каждый -v повышает)

source: vertical binning to N pixels
ru: вертикальный биннинг на N пикселей

source: wait for external trigger...
ru: ожидание внешнего триггера...
